# 打印一个倒 直角三角形五行五列
"""
* * * * *
* * * *
* * *
* *
*
"""
i = 1
while i <= 5:
    j = 1
    while j <= 6 - i:
        print('*', end=' ')
        j += 1
    print()
    i += 1

# 打印一个等腰三角形 (第一行1个* 第二行三个*, 5 7 9,一共5行)
"""
    *
   ***
  *****
 *******
*********
"""
# 外层循环控制行数
i = 1
while i <= 5:
    # 内层第一个循环控制空格的数量
    j = 1
    while j <= 5 - i:
        print('$',end='')
        j += 1
    # 内层第二个循环控制*号的数量
    # print('*' * (2*i-1),end='')
    k = 1
    while k <= 2 * i - 1:
        print('*', end='')
        k += 1
    print()
    i += 1